# FittingMustBeOnPipeWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..FittingMustBeOnPipeWarn Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
The [Tap] must be attached to pipe.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FittingMustBeOnPipeWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FittingMustBeOnPipeWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FittingMustBeOnPipeWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace